app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "gender", "integer", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "leeje"], ["gender", "male"], ["integer", ""], ["birthday", "2016-01-24"], ["created_at", "2018-02-24 09:24:22.137425"], ["updated_at", "2018-02-24 09:24:22.137425"]]